<div class="alert alert-warning" role="alert">
    УВАГА! Сервер бази данних mysql повинен бути запущений, створена база "test", імпортовані таблиці з файлу
    <a href="/source/test.sql">/public/source/test.sql</a>
    <br>Якщо база "test" створена, щоб імпортувати зазначені таблиці скорестуйтеся цим:
    <a href="/import_tables" class="btn btn-primary">Імпортувати таблиці в базу</a>
</div>

<h2>Тестове завдання 1:</h2>
<p>
    1. створити в базі даних таблицю товарів і таблицю категорій, і звязати їх між собою.<br/>
    2. занести в БД 10-20 товарів (в кожному має бути дата, ціна, назва товару) і 3-5 категорій<br/>
    3. вивести сторінку, на якій зліва буде список категорій (біля кожної назви категорій має бути число товарів в даній
    категорії), а справа список товарів.<br/>
    4. коли натискаємо на категорію, справа аяксом мають виводитись товари тільки вибраної категорії.<br/>
    5. вивести селектбокс в якому будуть три види сортування: спочатку дешевші, по алфавіту, спочатку нові<br/>
    6. при виборі порядку сортування в селектбоксі, має змінюватись порядок виведених товарів.<br/>
    7. у кожного товара має бути кнопка "купить" при нажиманні на яку відкривається модалка бустрапа, в якій буде
    виведений вибраний товар.<br/>
</p>
<p>
    обовязково: використовувати ООП<br/>
    обовязково: чистий php, без фреймворків.<br/>
    обовязково: зробити зміну сортування без перезавантаження сторінки.<br/>
    обовязково: передавати дані з php до js в вигляді json<br/>
</p>
<p>
    додатково: при зміні категорій і сортування в адресному рядку щоб додавались відповідні get-параметри, і при
    перезавантаженні сторінки ми маємо залишитись на тій же вибраній категорії яка була до перезавантаження
    сторінки.
</p>

<h2>Тестове завдання 2:</h2>
<p>
    Зробити php скрипт, який з бази візьме всі категорії <a href="/source/task_2_categories.sql">
        task_2_categories.sql</a> і побудує дерево
    наступного виду <a href="/imgs/task2.png" target="_blank">task2.png</a>
    - массив де ключ це id категорії. Якщо є підкатегорії у категорії,
    то значення - масив з підкатегоріями, якщо немає, то просто дублюється ключ.
    Час виконання скрипта не більше 2 сек, запит в базу не повинен бути закешованим.
</p>
